config/cf/Catalogs/ВидыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ВидыРабот</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/ВидыВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРабочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/ВидыРабот/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет виды работ по умолчанию.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьВидыРаботПриПервоначальномЗаполнении() Экспорт
	
	// Описываем стуктуру.
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("ВидВремени");
	
	ВД = Справочники.ВидыРабот;
	
	// Заполняем реквизитами.
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.ВыполнениеЗаданий,			НСтр("ru = 'Выполнение заданий'"), 			Перечисления.ВидыВремени.Рабочее);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Обед,						НСтр("ru = 'Обед'"), 						Перечисления.ВидыВремени.НеРабочее);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.РаботаСДокументами,			НСтр("ru = 'Работа с документами'"), 		Перечисления.ВидыВремени.Рабочее);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.ВыполнениеНарядовНаРаботы,	НСтр("ru = 'Выполнение нарядов на работы'"),Перечисления.ВидыВремени.Рабочее);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.ПрочиеРаботы,				НСтр("ru = 'Прочие работы'"), 				Перечисления.ВидыВремени.Рабочее);
	
	// Записываем.
	Для Каждого Строки Из ТЗ Цикл
		Объект = Строки.Объект.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		Объект.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьВТаблицуЗначений(ТЗ, Объект, Наименование, ВидВремени)
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Объект		 	= Объект;
	НоваяСтрока.Наименование 	= Наименование;
	НоваяСтрока.ВидВремени		= ВидВремени;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
